[
  {
    "id": "p1",
    "name": "Herb-Infused Hair Oil",
    "description": "This traditional Ayurvedic hair oil is carefully prepared using time-tested herbal formulations to nourish the scalp deeply. Enriched with powerful herbs like Brahmi and Bhringraj, it helps stimulate healthy hair growth and reduce excessive hair fall. The pure coconut oil base penetrates the scalp, improving blood circulation and strengthening hair follicles. Regular use helps repair damaged roots and adds natural shine to hair. Ideal for maintaining strong, thick, and healthy-looking hair naturally.",
    "price": 499.0,
    "imageUrl": "https://images.unsplash.com/photo-1617897903246-719242758050?auto=format&fit=crop&q=80&w=600",
    "benefits": ["Strengthens Roots", "Prevents Hair Fall", "Scalp Nourishment"],
    "ingredients": ["Brahmi", "Bringaraj", "Pure Coconut Oil"],
    "usage": "Massage onto scalp twice a week, leave for 2 hours.",
    "stock": 15,
    "isFavorite": false
  },
  {
    "id": "p2",
    "name": "Natural Glow Face Serum",
    "description": "This luxurious face serum is designed to enhance your skin’s natural glow using powerful Ayurvedic ingredients. Saffron and sandalwood help brighten the complexion and reduce dark spots over time. Aloe vera and vitamin E deeply hydrate and protect the skin from environmental damage. The lightweight formula absorbs quickly without clogging pores. With regular use, skin appears smoother, radiant, and evenly toned.",
    "price": 850.0,
    "imageUrl": "https://images.unsplash.com/photo-1601049541289-9b1b7bbbfe19?auto=format&fit=crop&q=80&w=600",
    "benefits": ["Radiant Glow", "Even Skin Tone", "Reduces Dark Spots"],
    "ingredients": ["Saffron", "Aloe Vera", "Vitamin E", "Sandalwood"],
    "usage": "Apply 3-4 drops at night on clean face.",
    "stock": 20,
    "isFavorite": true
  },
  {
    "id": "p3",
    "name": "Pure Ashwagandha Tablets",
    "description": "These premium Ashwagandha tablets are formulated to support stress relief and overall vitality. Ashwagandha is a powerful adaptogenic herb that helps the body manage physical and mental stress. Regular intake supports improved energy levels and better focus. It also helps strengthen immunity and promotes emotional balance. Ideal for daily wellness and long-term strength.",
    "price": 350.0,
    "imageUrl": "https://aarshaveda.com/cdn/shop/products/Ashwagandha-capsule.png?v=1713205232",
    "benefits": ["Stress Relief", "Boosts Energy", "Improves Focus"],
    "ingredients": ["100% Organic Ashwagandha Root"],
    "usage": "1 tablet twice daily after meals.",
    "stock": 10,
    "isFavorite": false
  },
  {
    "id": "p4",
    "name": "Aloe Vera Soothing Gel",
    "description": "This multipurpose Aloe Vera gel provides instant cooling and deep hydration to the skin. Made with 99% pure aloe extract, it helps soothe sunburns and calm skin irritation naturally. The lightweight, non-sticky formula absorbs quickly and refreshes the skin. Regular use improves skin texture and moisture balance. Suitable for face, body, and daily skincare routines.",
    "price": 250.0,
    "imageUrl": "https://www.oliviabeauty.in/cdn/shop/files/06_copy_1200x1200.jpg?v=1742810113",
    "benefits": ["Cooling Effect", "Deep Hydration", "Calms Irritation"],
    "ingredients": ["99% Pure Aloe Vera Gel"],
    "usage": "Apply as needed on skin for cooling effect.",
    "stock": 50,
    "isFavorite": false
  },
  {
    "id": "p5",
    "name": "Organic Triphala Churna",
    "description": "Triphala Churna is a classic Ayurvedic formulation known for its digestive and detoxifying benefits. This blend supports healthy digestion and bowel regularity. It helps cleanse the digestive system naturally and improves nutrient absorption. Rich in antioxidants and vitamin C, it also supports immunity. Regular use promotes overall gut health and internal balance.",
    "price": 299.0,
    "imageUrl": "https://m.media-amazon.com/images/I/61m37n8dTyL._AC_UF1000,1000_QL80_.jpg",
    "benefits": ["Digestive Support", "Natural Detox", "Rich in Vitamin C"],
    "ingredients": ["Amalaki", "Bibhitaki", "Haritaki"],
    "usage": "1 tsp with warm water before bed.",
    "stock": 30,
    "isFavorite": false
  },
  {
    "id": "p6",
    "name": "Brahmi Memory Booster",
    "description": "This herbal supplement is formulated with pure Brahmi extract to support brain health and mental clarity. Brahmi is traditionally used to enhance memory, focus, and concentration. It helps reduce mental fatigue and stress while calming the nervous system. Suitable for students and professionals alike. Regular use promotes sharper thinking and better mental performance.",
    "price": 425.0,
    "imageUrl": "https://m.media-amazon.com/images/I/61L5ggu3dYL._AC_UF1000,1000_QL80_.jpg",
    "benefits": ["Enhances Memory", "Reduces Mental Fatigue", "Calms the Mind"],
    "ingredients": ["Pure Brahmi Extract (Bacopa monnieri)"],
    "usage": "1 tablet twice daily with water.",
    "stock": 18,
    "isFavorite": false
  },
  {
    "id": "p7",
    "name": "Neem & Tulsi Face Wash",
    "description": "This antibacterial face wash is specially designed for acne-prone and oily skin. Neem and Tulsi help fight acne-causing bacteria and purify the skin deeply. Tea tree oil controls excess oil and prevents clogged pores. The gentle formula cleanses without drying the skin. Ideal for daily use to maintain clear and healthy skin.",
    "price": 199.0,
    "imageUrl": "https://www.pinkroot.in/cdn/shop/files/neem-tulsi-purifying-face-wash-100ml-pink-root-1.png?v=1725009908",
    "benefits": ["Prevents Acne", "Purifies Skin", "Oil Control"],
    "ingredients": ["Neem Oil", "Tulsi Extract", "Tea Tree Oil"],
    "usage": "Apply on wet face, massage and rinse.",
    "stock": 45,
    "isFavorite": false
  },
  {
    "id": "p8",
    "name": "Kumkumadi Glow Tailam",
    "description": "Kumkumadi Tailam is a luxurious Ayurvedic facial oil known for enhancing skin glow. Infused with saffron and herbal extracts, it helps repair skin overnight. Regular use reduces pigmentation, fine lines, and dullness. The nourishing oils deeply hydrate and improve skin texture. Ideal for nighttime skincare to achieve radiant, youthful skin.",
    "price": 1250.0,
    "imageUrl": "https://m.media-amazon.com/images/I/81KDn7vgk1L._AC_UF1000,1000_QL80_.jpg",
    "benefits": ["Anti-Aging", "Brightens Skin", "Intense Hydration"],
    "ingredients": ["Kesar", "Manjistha", "Goat Milk", "Sesame Oil"],
    "usage": "Apply 2 drops on face after cleansing at night.",
    "stock": 12,
    "isFavorite": true
  },
  {
    "id": "p9",
    "name": "Shatavari Vitality Capsules",
    "description": "These capsules are made with organic Shatavari extract to support women’s health naturally. Shatavari helps maintain hormonal balance and reproductive wellness. It also strengthens immunity and improves overall vitality. Traditionally used for long-term female wellness. Regular intake supports strength, balance, and overall health.",
    "price": 380.0,
    "imageUrl": "https://m.media-amazon.com/images/I/61rk84NE0RL._AC_UF1000,1000_QL80_.jpg",
    "benefits": ["Hormonal Balance", "Boosts Immunity", "Supports Lactation"],
    "ingredients": ["Organic Shatavari Extract"],
    "usage": "1 capsule daily after breakfast.",
    "stock": 25,
    "isFavorite": false
  },
  {
    "id": "p10",
    "name": "Golden Turmeric Latte Mix",
    "description": "This golden turmeric latte mix is a warming blend of turmeric and Ayurvedic spices. It supports immunity, digestion, and overall wellness. Black pepper enhances turmeric absorption for maximum benefits. Ideal for daily consumption as a comforting health drink. A natural and delicious way to support a healthy lifestyle.",
    "price": 320.0,
    "imageUrl": "https://www.coffeeness.de/wp-content/uploads/2024/06/kurkuma-latte-rezept.jpg",
    "benefits": ["Anti-Inflammatory", "Boosts Immunity", "Improves Digestion"],
    "ingredients": ["Lakadong Turmeric", "Black Pepper", "Ginger", "Cardamom"],
    "usage": "Mix 1/2 tsp in hot milk or water.",
    "stock": 40,
    "isFavorite": false
  }
]
